var element = document.getElementById("Starter");

function updater2() {
    if (stat == "2.1") {
        element.innerHTML = "אתה הולך לדאנגן.</br>אתה מקבל בתחת חזק אך לפתע אתה נזכר כי שכחת לקנות עגבניות.";
        stat = "2.12";
    } else if (stat == "2.2") {
        element.innerHTML = "אתה מזיין עוד סוס.</br>במקרה לסוס יש איידס ואתה מת.";
        stat = "1";
    } else if (stat == "2.3") {
        element.innerHTML = "אתה קופץ בטעות לתוך בריכת התנינים המלאה בלבה שיש לך בחצר.</br>אתה יודע מה הולך לקרות עכשיו.";
        stat = "1";
    } else if (stat == "2.121") {
        element.innerHTML = "קיבלת בתחת חזק מדי.</br>יורד לך דם.";
        stat = "2.1210";
    } else if (stat == "2.12101") {
        element.innerHTML = "דחפת את הדילדו עמוק מדי וקרעת לעצמך את הריאות.</br>אתה מת.";
        stat = "1";
    } else if (stat == "2.12102") {
        element.innerHTML = "אתה גונב לאחת הבנות את הפד מאיבר המין.</br>אתה לובש את הפד והדימום נעצר וזה גורם לך לקבל אורגזמה,</br>אך אתה מקבל תלונה במשטרה על הטרדה מינית.";
        stat = "3";
    } else if (stat == "2.12103") {
        element.innerHTML = "אחת הבנות ליקקה לך את התחת והדימום נעצר.</br>לאחר כשלושה ימים אתה מקבל תביעה כי היא חטפה הרפס.</br>אתה נשאר עני ברחוב ללא אוכל או כסף.</br>אתה מנסה להדליק מדורה אך השמן שנשאר עליך מהדאנגן שורף אותך לעפר.";
        stat = "1";
    } else if (stat == "2.1221") {
        element.innerHTML = "סוחרים אחרים באיזור רואים שאתה מכור לסמים.</br>הם מציעים לך להצטרף אליהם.";
        stat = "2.12210";
    } else if (stat == "2.122101") {
        element.innerHTML = "הסוחרים לוקחים את הסירוב כחוסר כבוד.</br>הם יורים בך על המקום.";
        stat = "1";
    } else if (stat == "2.122102") {
        element.innerHTML = "אתה מצטרף אליהם.</br>לאחר כמה שנים אתה בעסקת סמים אך המשטרה מציפה את המקום ויורה בכולם.</br>למזלך רק אתה שרדת.";
        stat = "3";
    } else if (stat == "2.1222") {
        element.innerHTML = "כולם נבהלו וגילו שאתה החמוס הגאנג באנג.</br>המשטרה לא חיכתה לרגע ועצרה אותך.";
        stat = "3";
    } else if (stat == "2.1223") {
        element.innerHTML = "אתה גומר בתוך המוכרת.</br>היא נכנסת להיריון ומוגשת מולך תלונה על הטרדה מינית.";
        stat = "3";
    } else if (stat == "3") {
        element.innerHTML = "אתה נכנס לכלא.";
        stat = "3.1";
    } else if (stat == "3.12") {
        element.innerHTML = "אתה עולה על מטוס לכלא רוסי.</br>לצערך נותנים לך להיות בו עם תחתונים בלבד.</br>אתה מת מהיפותרמיה.";
        stat = "1";
    } else if (stat == "3.32") {
        element.innerHTML = "כל חברי הארגון מתאבדים מרוב צער.</br>המשטרה חושבת שאתה רצחת אותם אז היא יורה בך.";
        stat = "1";
    } else if (stat == "3.31") {
        element.innerHTML = "אתה הופך לראש הארגון.</br>אתה קורה לארגון אל קאיידה.";
        stat = "4";
    } else if (stat == "4.1") {
        element.innerHTML = "בזמן שאתה מתכנן את הבריחה, אתה נתקל באדם מיוחד במיוחד.</br>שמו הוא אייכמן.</br>אתם חוברים אחד עם השני על מנת לברוח מהכלא.";
        stat = "4.11";
    } else if (stat == "4.11") {
        element.innerHTML = "אתה מתחיל את הבריחה.</br>אתה מתקדם לכיוון היציאה אך לפתע תופס אותך אחד השומרים.";
        stat = "5";
    } else if (stat == "4.2") {
        element.innerHTML = "התאריך הוא ה11 בספטמבר 2001.</br>זה הוא יום ההולדת שלך.</br>לכבוד יום ההולדת שלך אתה מבקש בקשה מחברי הארגון שמחוץ לכלא.";
        stat = "4.20";
    } else if (stat == "4.201") {
        element.innerHTML = "החמוס אכל לך את האיברים הפנימיים.</br>אתה מת.";
        stat = "4.20";
    } else if (stat == "4.202") {
        element.innerHTML = "חברי הארגון חטפו בשבילך 2 מטוסי נוסעים מדגם בויינג 7.</br>הם התקדמו לכיוון מגדלי התאומים שבניו יורק והתנגשו בהם.";
        stat = "4.2011";
    } else if (stat == "4.2011") {
        element.innerHTML = "חוקרי האף בי איי גילו שאתה עמדת בראש הפיגוע ושאייכמן היה מאחורי הקלעים.";
        stat = "5";
    } else if (stat == "5") {
        element.innerHTML = "למזלך אייכמן היה אובדני והוא מתנדב להיתלות במקומך.";
        stat = "6";
    } else if (stat == "6") {
        element.innerHTML = "עברו שנים רבות מאז ואתה תכננת בריחה חדשה מהכלא.</br>הבריחה הייתה מוצלחת ואתה הצלחת להימלט לפקיסטן.</br>לצערך חמוסים בכנופייה פקיסטנית התנקשו בך.";
        stat = "7";
    } else if (stat == "7") {
        element.innerHTML = "הסוף.";
        stat = "8";
    }
}